In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'a':[1,np.nan,4],'b':[np.nan,5,np.nan],'c':[1,2,np.nan]}
d

{'a': [1, nan, 4], 'b': [nan, 5, nan], 'c': [1, 2, nan]}

In [3]:
df=pd.DataFrame(d)

In [4]:
df

     a    b    c
0  1.0  NaN  1.0
1  NaN  5.0  2.0
2  4.0  NaN  NaN

# dropna

In [6]:
#we use dropna to drop all the nan value related rows
#we can actuallgive axis to dleted the nan values either from row or column
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [7]:
#by default axis=0
df.dropna()

Empty DataFrame
Columns: [a, b, c]
Index: []

In [9]:
#we actually have thres parameter which take sthe threshol dvalues and remove when it is more than threshold
df.dropna(thresh=2)

     a    b    c
0  1.0  NaN  1.0
1  NaN  5.0  2.0

# fillna

In [10]:
#if we want to fill some value into nan place
df.fillna(value='filled dummy')

              a             b             c
0           1.0  filled dummy           1.0
1  filled dummy           5.0           2.0
2           4.0  filled dummy  filled dummy

In [11]:
#we can do it individually also
df['a'].fillna(value='others')

0       1.0
1    others
2       4.0
Name: a, dtype: object